zephyrproject-rtos/hal_nxp/dts/nxp/s32/S32K342_K341_K322_172HDQFP-pinctrl.h
/*
 * Copyright 2026 NXP
 *
 * SPDX-License-Identifier: Apache-2.0
 */

/*
 * Delta-deduplicated by dedup_pinctrl.py:
 * based on S32K344_K324_K314_257BGA-pinctrl.h with this part's differences applied
 * below (671 removed, 7 changed,
 * 26 added). Regenerate with dedup_pinctrl.py;
 * do not edit by hand.
 * target-hash: 12f8105ca85c6145
 */

#ifndef _ZEPHYR_DTS_BINDING_S32K342_K341_K322_172HDQFP_WRAPPER_
#define _ZEPHYR_DTS_BINDING_S32K342_K341_K322_172HDQFP_WRAPPER_

#include "S32K344_K324_K314_257BGA-pinctrl.h"

/* Signals not present on this part */
#undef PTA0_LPSPI4_PCS2_I
#undef PTA0_LPSPI4_PCS2_O
#undef PTA12_LPUART11_RX
#undef PTA13_LPUART11_TX_I
#undef PTA13_LPUART11_TX_O
#undef PTA14_EMIOS_2_CH18_Y_I
#undef PTA14_EMIOS_2_CH18_Y_O
#undef PTA14_LPSPI5_PCS1_I
#undef PTA14_LPSPI5_PCS1_O
#undef PTA15_LPSPI5_PCS0_I
#undef PTA15_LPSPI5_PCS0_O
#undef PTA15_LPUART6_RX
#undef PTA16_LPSPI4_PCS3_I
#undef PTA16_LPSPI4_PCS3_O
#undef PTA16_LPUART6_TX_I
#undef PTA16_LPUART6_TX_O
#undef PTA17_LPUART4_TX_I
#undef PTA17_LPUART4_TX_O
#undef PTA18_EMIOS_2_CH0_X_I
#undef PTA18_EMIOS_2_CH0_X_O
#undef PTA19_EMIOS_2_CH1_H_I
#undef PTA19_EMIOS_2_CH1_H_O
#undef PTA1_LPSPI4_PCS1_I
#undef PTA1_LPSPI4_PCS1_O
#undef PTA20_EMIOS_2_CH2_H_I
#undef PTA20_EMIOS_2_CH2_H_O
#undef PTA21_EMIOS_2_CH3_H_I
#undef PTA21_EMIOS_2_CH3_H_O
#undef PTA22_CAN1_RX
#undef PTA22_EMIOS_1_CH4_H_I
#undef PTA22_EMIOS_1_CH4_H_O
#undef PTA22_FXIO_D1_I
#undef PTA22_FXIO_D1_O
#undef PTA22_LPSPI1_PCS1_I
#undef PTA22_LPSPI1_PCS1_O
#undef PTA23_CAN1_TX
#undef PTA23_EMIOS_1_CH6_H_I
#undef PTA23_EMIOS_1_CH6_H_O
#undef PTA23_FXIO_D2_I
#undef PTA23_FXIO_D2_O
#undef PTA25_EMIOS_2_CH8_X
#undef PTA26_EMAC_PPS0_I
#undef PTA26_EMAC_PPS0_O
#undef PTA26_EMIOS_1_CH9_H_I
#undef PTA26_EMIOS_1_CH9_H_O
#undef PTA26_EMIOS_2_CH9_H_I
#undef PTA26_EMIOS_2_CH9_H_O
#undef PTA26_FXIO_D1_I
#undef PTA26_FXIO_D1_O
#undef PTA26_LPSPI0_PCS0_I
#undef PTA26_LPSPI0_PCS0_O
#undef PTA26_LPSPI1_PCS0_I
#undef PTA26_LPSPI1_PCS0_O
#undef PTA27_EMIOS_2_CH10_H_I
#undef PTA27_EMIOS_2_CH10_H_O
#undef PTA28_EMIOS_2_CH11_H_I
#undef PTA28_EMIOS_2_CH11_H_O
#undef PTA29_EMIOS_2_CH12_H_I
#undef PTA29_EMIOS_2_CH12_H_O
#undef PTA2_LPSPI5_SIN_I
#undef PTA2_LPSPI5_SIN_O
#undef PTA30_EMIOS_2_CH13_H_I
#undef PTA30_EMIOS_2_CH13_H_O
#undef PTA3_LPSPI5_SCK_I
#undef PTA3_LPSPI5_SCK_O
#undef PTA8_EMIOS_2_CH7_H_I
#undef PTA8_EMIOS_2_CH7_H_O
#undef PTA9_CMP2_OUT
#undef PTB10_LPSPI4_SCK_I
#undef PTB10_LPSPI4_SCK_O
#undef PTB10_LPUART9_TX_I
#undef PTB10_LPUART9_TX_O
#undef PTB11_LPSPI4_SIN_I
#undef PTB11_LPSPI4_SIN_O
#undef PTB12_LPUART8_RX
#undef PTB13_LPUART8_TX_I
#undef PTB13_LPUART8_TX_O
#undef PTB14_LPUART7_RX
#undef PTB15_LPUART7_TX_I
#undef PTB15_LPUART7_TX_O
#undef PTB16_LPUART4_TX_I
#undef PTB16_LPUART4_TX_O
#undef PTB17_LPUART4_RX
#undef PTB18_EMIOS_2_CH14_H_I
#undef PTB18_EMIOS_2_CH14_H_O
#undef PTB18_LPUART13_TX_I
#undef PTB18_LPUART13_TX_O
#undef PTB19_EMIOS_2_CH15_H_I
#undef PTB19_EMIOS_2_CH15_H_O
#undef PTB19_LPUART13_RX
#undef PTB20_EMIOS_2_CH16_X_I
#undef PTB20_EMIOS_2_CH16_X_O
#undef PTB20_LPUART14_TX_I
#undef PTB20_LPUART14_TX_O
#undef PTB21_EMIOS_2_CH17_Y_I
#undef PTB21_EMIOS_2_CH17_Y_O
#undef PTB21_LPUART14_RX
#undef PTB22_EMIOS_2_CH18_Y_I
#undef PTB22_EMIOS_2_CH18_Y_O
#undef PTB23_EMIOS_2_CH19_Y_I
#undef PTB23_EMIOS_2_CH19_Y_O
#undef PTB24_EMIOS_2_CH20_Y_I
#undef PTB24_EMIOS_2_CH20_Y_O
#undef PTB25_EMIOS_2_CH21_Y_I
#undef PTB25_EMIOS_2_CH21_Y_O
#undef PTB25_LPUART15_TX_I
#undef PTB25_LPUART15_TX_O
#undef PTB26_EMIOS_2_CH22_X_I
#undef PTB26_EMIOS_2_CH22_X_O
#undef PTB26_LPUART15_RX
#undef PTB27_EMIOS_2_CH23_X_I
#undef PTB27_EMIOS_2_CH23_X_O
#undef PTB27_LPUART5_TX_I
#undef PTB27_LPUART5_TX_O
#undef PTB28_EMIOS_2_CH10_H_I
#undef PTB28_EMIOS_2_CH10_H_O
#undef PTB28_LPUART5_RX
#undef PTB29_EMIOS_2_CH11_H_I
#undef PTB29_EMIOS_2_CH11_H_O
#undef PTB29_LPUART6_TX_I
#undef PTB29_LPUART6_TX_O
#undef PTB2_CAN4_RX
#undef PTB2_LPUART9_RX
#undef PTB30_FXIO_D11_I
#undef PTB30_FXIO_D11_O
#undef PTB30_HSE_TAMPER_LOOP_OUT0
#undef PTB31_EIRQ15
#undef PTB31_HSE_TAMPER_EXTIN0
#undef PTB3_CAN4_TX
#undef PTB3_LPUART9_TX_I
#undef PTB3_LPUART9_TX_O
#undef PTB8_LPSPI4_PCS0_I
#undef PTB8_LPSPI4_PCS0_O
#undef PTB9_LPSPI4_SOUT_I
#undef PTB9_LPSPI4_SOUT_O
#undef PTB9_LPUART9_RX
#undef PTC10_CAN5_TX
#undef PTC10_LPSPI4_PCS0_I
#undef PTC10_LPSPI4_PCS0_O
#undef PTC10_LPUART11_TX_I
#undef PTC10_LPUART11_TX_O
#undef PTC11_CAN5_RX
#undef PTC11_LPSPI4_SOUT_I
#undef PTC11_LPSPI4_SOUT_O
#undef PTC11_LPUART11_RX
#undef PTC12_LPUART10_RX
#undef PTC13_LPUART10_TX_I
#undef PTC13_LPUART10_TX_O
#undef PTC16_EMIOS_2_CH9_H_I
#undef PTC16_EMIOS_2_CH9_H_O
#undef PTC18_EMIOS_2_CH12_H_I
#undef PTC18_EMIOS_2_CH12_H_O
#undef PTC18_LPUART6_RX
#undef PTC19_EMIOS_2_CH13_H_I
#undef PTC19_EMIOS_2_CH13_H_O
#undef PTC19_LPUART7_TX_I
#undef PTC19_LPUART7_TX_O
#undef PTC20_EMIOS_2_CH14_H_I
#undef PTC20_EMIOS_2_CH14_H_O
#undef PTC20_LPUART7_RX
#undef PTC21_EMIOS_2_CH15_H_I
#undef PTC21_EMIOS_2_CH15_H_O
#undef PTC22_EMIOS_0_CH8_X_I
#undef PTC22_EMIOS_0_CH8_X_O
#undef PTC24_EMIOS_2_CH0_X_I
#undef PTC24_EMIOS_2_CH0_X_O
#undef PTC24_LPUART12_TX_I
#undef PTC24_LPUART12_TX_O
#undef PTC25_EMIOS_2_CH1_H_I
#undef PTC25_EMIOS_2_CH1_H_O
#undef PTC25_LPSPI4_PCS1_I
#undef PTC25_LPSPI4_PCS1_O
#undef PTC25_LPUART12_RX
#undef PTC26_CAN5_RX
#undef PTC26_EMIOS_2_CH2_H_I
#undef PTC26_EMIOS_2_CH2_H_O
#undef PTC26_LPSPI4_SIN_I
#undef PTC26_LPSPI4_SIN_O
#undef PTC26_LPUART13_TX_I
#undef PTC26_LPUART13_TX_O
#undef PTC27_CAN5_TX
#undef PTC27_EMIOS_2_CH3_H_I
#undef PTC27_EMIOS_2_CH3_H_O
#undef PTC27_LPSPI4_SCK_I
#undef PTC27_LPSPI4_SCK_O
#undef PTC27_LPUART13_RX
#undef PTC29_EMIOS_2_CH4_H_I
#undef PTC29_EMIOS_2_CH4_H_O
#undef PTC2_TRACE_ETM_CLKOUT
#undef PTC30_CAN4_TX
#undef PTC30_EMIOS_2_CH5_H_I
#undef PTC30_EMIOS_2_CH5_H_O
#undef PTC31_CAN4_RX
#undef PTC31_EMIOS_2_CH6_H_I
#undef PTC31_EMIOS_2_CH6_H_O
#undef PTC5_CMP2_RR_ACTIVE
#undef PTD0_LPUART5_RX
#undef PTD10_TRACE_ETM_D3
#undef PTD11_TRACE_ETM_D2
#undef PTD12_TRACE_ETM_D1
#undef PTD13_LPSPI5_SIN_I
#undef PTD13_LPSPI5_SIN_O
#undef PTD14_LPSPI5_SCK_I
#undef PTD14_LPSPI5_SCK_O
#undef PTD15_LPUART8_RX
#undef PTD16_LPUART8_TX_I
#undef PTD16_LPUART8_TX_O
#undef PTD17_CAN5_RX
#undef PTD17_LPSPI5_PCS0_I
#undef PTD17_LPSPI5_PCS0_O
#undef PTD18_CAN2_TX
#undef PTD18_EMIOS_1_CH15_H_I
#undef PTD18_EMIOS_1_CH15_H_O
#undef PTD18_FXIO_D2_I
#undef PTD18_FXIO_D2_O
#undef PTD19_CAN2_RX
#undef PTD19_EMIOS_1_CH16_X_I
#undef PTD19_EMIOS_1_CH16_X_O
#undef PTD19_FXIO_D3_I
#undef PTD19_FXIO_D3_O
#undef PTD1_LPUART5_TX_I
#undef PTD1_LPUART5_TX_O
#undef PTD20_EMIOS_2_CH0_X_I
#undef PTD20_EMIOS_2_CH0_X_O
#undef PTD21_EMIOS_2_CH8_X_I
#undef PTD21_EMIOS_2_CH8_X_O
#undef PTD22_EMIOS_2_CH22_X_I
#undef PTD22_EMIOS_2_CH22_X_O
#undef PTD23_EMIOS_2_CH23_X_I
#undef PTD23_EMIOS_2_CH23_X_O
#undef PTD25_EMIOS_1_CH22_X_I
#undef PTD25_EMIOS_1_CH22_X_O
#undef PTD26_EMIOS_2_CH7_H_I
#undef PTD26_EMIOS_2_CH7_H_O
#undef PTD26_LPSPI5_SCK_I
#undef PTD26_LPSPI5_SCK_O
#undef PTD26_LPUART14_TX_I
#undef PTD26_LPUART14_TX_O
#undef PTD27_EMIOS_2_CH9_H_I
#undef PTD27_EMIOS_2_CH9_H_O
#undef PTD27_LPSPI5_SOUT_I
#undef PTD27_LPSPI5_SOUT_O
#undef PTD27_LPUART14_RX
#undef PTD28_EMIOS_2_CH0_X_I
#undef PTD28_EMIOS_2_CH0_X_O
#undef PTD28_LPSPI5_SIN_I
#undef PTD28_LPSPI5_SIN_O
#undef PTD28_LPUART15_TX_I
#undef PTD28_LPUART15_TX_O
#undef PTD29_EMIOS_2_CH8_X_I
#undef PTD29_EMIOS_2_CH8_X_O
#undef PTD29_LPSPI5_PCS2_I
#undef PTD29_LPSPI5_PCS2_O
#undef PTD29_LPUART15_RX
#undef PTD2_LPSPI5_SOUT_I
#undef PTD2_LPSPI5_SOUT_O
#undef PTD30_EMIOS_2_CH16_X_I
#undef PTD30_EMIOS_2_CH16_X_O
#undef PTD30_LPSPI5_PCS3_I
#undef PTD30_LPSPI5_PCS3_O
#undef PTD31_EMIOS_2_CH22_X_I
#undef PTD31_EMIOS_2_CH22_X_O
#undef PTD4_LPSPI5_PCS0_I
#undef PTD4_LPSPI5_PCS0_O
#undef PTD7_TRACE_ETM_D0
#undef PTD8_LPUART6_RX
#undef PTD9_LPUART6_TX_I
#undef PTD9_LPUART6_TX_O
#undef PTE0_LPUART7_RX
#undef PTE10_LPUART4_RX
#undef PTE11_LPUART4_TX_I
#undef PTE11_LPUART4_TX_O
#undef PTE12_CAN5_TX
#undef PTE14_CAN4_RX
#undef PTE14_LPUART5_TX_I
#undef PTE14_LPUART5_TX_O
#undef PTE17_EMIOS_2_CH23_X_I
#undef PTE17_EMIOS_2_CH23_X_O
#undef PTE18_EMIOS_2_CH17_Y_I
#undef PTE18_EMIOS_2_CH17_Y_O
#undef PTE19_EMIOS_0_CH22_X_I
#undef PTE19_EMIOS_0_CH22_X_O
#undef PTE1_LPUART7_TX_I
#undef PTE1_LPUART7_TX_O
#undef PTE20_EMIOS_1_CH0_X_I
#undef PTE20_EMIOS_1_CH0_X_O
#undef PTE21_EMIOS_2_CH19_Y_I
#undef PTE21_EMIOS_2_CH19_Y_O
#undef PTE21_LPSPI4_SIN_I
#undef PTE21_LPSPI4_SIN_O
#undef PTE22_EMIOS_2_CH20_Y_I
#undef PTE22_EMIOS_2_CH20_Y_O
#undef PTE22_LPSPI4_SCK_I
#undef PTE22_LPSPI4_SCK_O
#undef PTE23_EMIOS_2_CH21_Y_I
#undef PTE23_EMIOS_2_CH21_Y_O
#undef PTE23_LPSPI4_PCS0_I
#undef PTE23_LPSPI4_PCS0_O
#undef PTE24_EMIOS_2_CH4_H_I
#undef PTE24_EMIOS_2_CH4_H_O
#undef PTE24_LPSPI4_PCS1_I
#undef PTE24_LPSPI4_PCS1_O
#undef PTE25_EMIOS_2_CH5_H_I
#undef PTE25_EMIOS_2_CH5_H_O
#undef PTE25_LPSPI4_SOUT_I
#undef PTE25_LPSPI4_SOUT_O
#undef PTE26_EMIOS_2_CH6_H_I
#undef PTE26_EMIOS_2_CH6_H_O
#undef PTE27_EMIOS_1_CH7_H_I
#undef PTE27_EMIOS_1_CH7_H_O
#undef PTE28_CAN3_TX
#undef PTE29_CAN3_RX
#undef PTE2_LPUART10_RX
#undef PTE30_CAN4_TX
#undef PTE30_CMP1_OUT
#undef PTE31_CAN4_RX
#undef PTE31_CMP1_RR_ACTIVES
#undef PTE3_CAN4_TX
#undef PTE3_LPUART5_RX
#undef PTE4_LPUART12_TX_I
#undef PTE4_LPUART12_TX_O
#undef PTE5_LPUART12_RX
#undef PTE6_LPUART10_TX_I
#undef PTE6_LPUART10_TX_O
#undef PTE7_LPUART4_RX
#undef PTE8_LPSPI5_PCS1_I
#undef PTE8_LPSPI5_PCS1_O
#undef PTE9_LPSPI5_SOUT_I
#undef PTE9_LPSPI5_SOUT_O
#undef PTF0_EIRQ0
#undef PTF0_EMIOS_2_CH0_X_I
#undef PTF0_EMIOS_2_CH0_X_O
#undef PTF0_LPSPI2_SCK_I
#undef PTF0_LPSPI2_SCK_O
#undef PTF0_LPUART5_TX_I
#undef PTF0_LPUART5_TX_O
#undef PTF10_ADC0_MA1
#undef PTF10_EIRQ18
#undef PTF10_EMIOS_2_CH10_H_I
#undef PTF10_EMIOS_2_CH10_H_O
#undef PTF11_ADC0_MA2
#undef PTF11_EIRQ19
#undef PTF11_EMIOS_2_CH11_H_I
#undef PTF11_EMIOS_2_CH11_H_O
#undef PTF11_HSE_TAMPER_EXTIN0
#undef PTF12_ADC0_MA0
#undef PTF12_EIRQ20
#undef PTF12_EMIOS_2_CH12_H_I
#undef PTF12_EMIOS_2_CH12_H_O
#undef PTF12_LPSPI3_SIN_I
#undef PTF12_LPSPI3_SIN_O
#undef PTF12_LPUART10_TX_I
#undef PTF12_LPUART10_TX_O
#undef PTF13_ADC0_MA1
#undef PTF13_EIRQ21
#undef PTF13_EMIOS_2_CH13_H_I
#undef PTF13_EMIOS_2_CH13_H_O
#undef PTF13_LPSPI3_SCK_I
#undef PTF13_LPSPI3_SCK_O
#undef PTF13_LPUART10_RX
#undef PTF14_CAN1_TX
#undef PTF14_CMP0_OUT
#undef PTF14_EIRQ22
#undef PTF14_EMIOS_2_CH14_H_I
#undef PTF14_EMIOS_2_CH14_H_O
#undef PTF14_FCCU_ERR0
#undef PTF14_FCCU_ERR_IN0
#undef PTF14_FXIO_D3_I
#undef PTF14_FXIO_D3_O
#undef PTF15_CAN1_RX
#undef PTF15_CMP0_RR_ACTIVE
#undef PTF15_EIRQ23
#undef PTF15_EMIOS_2_CH15_H_I
#undef PTF15_EMIOS_2_CH15_H_O
#undef PTF15_FCCU_ERR1
#undef PTF15_FCCU_ERR_IN1
#undef PTF15_LPSPI3_SOUT_I
#undef PTF15_LPSPI3_SOUT_O
#undef PTF16_ADC1_MA0
#undef PTF16_EMIOS_1_CH0_X_I
#undef PTF16_EMIOS_1_CH0_X_O
#undef PTF16_EMIOS_2_CH16_X_I
#undef PTF16_EMIOS_2_CH16_X_O
#undef PTF16_LPSPI3_PCS0_I
#undef PTF16_LPSPI3_PCS0_O
#undef PTF16_LPUART12_TX_I
#undef PTF16_LPUART12_TX_O
#undef PTF17_ADC1_MA1
#undef PTF17_EMIOS_1_CH1_H_I
#undef PTF17_EMIOS_1_CH1_H_O
#undef PTF17_EMIOS_2_CH17_Y_I
#undef PTF17_EMIOS_2_CH17_Y_O
#undef PTF17_LPUART12_RX
#undef PTF18_ADC1_MA2
#undef PTF18_EMIOS_1_CH2_H_I
#undef PTF18_EMIOS_1_CH2_H_O
#undef PTF18_EMIOS_2_CH18_Y_I
#undef PTF18_EMIOS_2_CH18_Y_O
#undef PTF18_LPSPI3_PCS1_I
#undef PTF18_LPSPI3_PCS1_O
#undef PTF18_LPUART7_TX_I
#undef PTF18_LPUART7_TX_O
#undef PTF19_ADC0_MA2
#undef PTF19_EMIOS_1_CH3_H_I
#undef PTF19_EMIOS_1_CH3_H_O
#undef PTF19_EMIOS_2_CH19_Y_I
#undef PTF19_EMIOS_2_CH19_Y_O
#undef PTF19_HSE_TAMPER_LOOP_OUT0
#undef PTF19_LPSPI3_PCS2_I
#undef PTF19_LPSPI3_PCS2_O
#undef PTF19_LPUART7_RX
#undef PTF1_EIRQ1
#undef PTF1_EMIOS_2_CH1_H_I
#undef PTF1_EMIOS_2_CH1_H_O
#undef PTF1_LPSPI2_SIN_I
#undef PTF1_LPSPI2_SIN_O
#undef PTF1_LPUART5_RX
#undef PTF20_CAN0_TX
#undef PTF20_EMIOS_1_CH4_H_I
#undef PTF20_EMIOS_1_CH4_H_O
#undef PTF20_EMIOS_2_CH20_Y_I
#undef PTF20_EMIOS_2_CH20_Y_O
#undef PTF20_FXIO_D4_I
#undef PTF20_FXIO_D4_O
#undef PTF20_LPI2C0_SCL_I
#undef PTF20_LPI2C0_SCL_O
#undef PTF20_LPSPI3_PCS3_I
#undef PTF20_LPSPI3_PCS3_O
#undef PTF20_LPUART8_TX_I
#undef PTF20_LPUART8_TX_O
#undef PTF21_CAN0_RX
#undef PTF21_EMIOS_1_CH5_H_I
#undef PTF21_EMIOS_1_CH5_H_O
#undef PTF21_EMIOS_2_CH21_Y_I
#undef PTF21_EMIOS_2_CH21_Y_O
#undef PTF21_FXIO_D5_I
#undef PTF21_FXIO_D5_O
#undef PTF21_LPI2C0_SDA_I
#undef PTF21_LPI2C0_SDA_O
#undef PTF21_LPSPI1_PCS0_I
#undef PTF21_LPSPI1_PCS0_O
#undef PTF21_LPUART8_RX
#undef PTF22_EMIOS_1_CH6_H_I
#undef PTF22_EMIOS_1_CH6_H_O
#undef PTF22_EMIOS_2_CH22_X_I
#undef PTF22_EMIOS_2_CH22_X_O
#undef PTF22_LPSPI4_PCS2_I
#undef PTF22_LPSPI4_PCS2_O
#undef PTF23_EMIOS_1_CH7_H_I
#undef PTF23_EMIOS_1_CH7_H_O
#undef PTF23_EMIOS_2_CH23_X_I
#undef PTF23_EMIOS_2_CH23_X_O
#undef PTF23_LPSPI3_PCS3_I
#undef PTF23_LPSPI3_PCS3_O
#undef PTF23_LPUART9_TX_I
#undef PTF23_LPUART9_TX_O
#undef PTF24_EMIOS_1_CH8_X_I
#undef PTF24_EMIOS_1_CH8_X_O
#undef PTF24_LPUART9_RX
#undef PTF25_CAN2_TX
#undef PTF25_EMIOS_1_CH9_H_I
#undef PTF25_EMIOS_1_CH9_H_O
#undef PTF25_FXIO_D6_I
#undef PTF25_FXIO_D6_O
#undef PTF25_LPSPI2_PCS2_I
#undef PTF25_LPSPI2_PCS2_O
#undef PTF25_LPSPI4_PCS0_I
#undef PTF25_LPSPI4_PCS0_O
#undef PTF26_CAN2_RX
#undef PTF26_EMIOS_1_CH10_H_I
#undef PTF26_EMIOS_1_CH10_H_O
#undef PTF26_LPSPI2_PCS3_I
#undef PTF26_LPSPI2_PCS3_O
#undef PTF26_LPSPI4_PCS1_I
#undef PTF26_LPSPI4_PCS1_O
#undef PTF27_EMIOS_1_CH11_H_I
#undef PTF27_EMIOS_1_CH11_H_O
#undef PTF27_LPSPI4_PCS2_I
#undef PTF27_LPSPI4_PCS2_O
#undef PTF27_LPUART11_TX_I
#undef PTF27_LPUART11_TX_O
#undef PTF28_EMIOS_1_CH12_H_I
#undef PTF28_EMIOS_1_CH12_H_O
#undef PTF28_FXIO_D7_I
#undef PTF28_FXIO_D7_O
#undef PTF28_LPSPI0_PCS0_I
#undef PTF28_LPSPI0_PCS0_O
#undef PTF28_LPSPI4_PCS3_I
#undef PTF28_LPSPI4_PCS3_O
#undef PTF28_LPUART11_RX
#undef PTF28_TRACE_ETM_D5
#undef PTF29_ADC1_MA0
#undef PTF29_CAN3_TX
#undef PTF29_EMIOS_1_CH13_H_I
#undef PTF29_EMIOS_1_CH13_H_O
#undef PTF29_FXIO_D8_I
#undef PTF29_FXIO_D8_O
#undef PTF29_LPSPI3_PCS1_I
#undef PTF29_LPSPI3_PCS1_O
#undef PTF2_EIRQ2
#undef PTF2_EMIOS_2_CH2_H_I
#undef PTF2_EMIOS_2_CH2_H_O
#undef PTF2_LPSPI2_SOUT_I
#undef PTF2_LPSPI2_SOUT_O
#undef PTF2_LPUART6_TX_I
#undef PTF2_LPUART6_TX_O
#undef PTF30_ADC1_MA1
#undef PTF30_CAN3_RX
#undef PTF30_EMIOS_1_CH14_H_I
#undef PTF30_EMIOS_1_CH14_H_O
#undef PTF31_ADC1_MA2
#undef PTF31_EMIOS_1_CH15_H_I
#undef PTF31_EMIOS_1_CH15_H_O
#undef PTF31_FXIO_D9_I
#undef PTF31_FXIO_D9_O
#undef PTF31_TRACE_ETM_D3
#undef PTF3_EIRQ3
#undef PTF3_EMIOS_2_CH3_H_I
#undef PTF3_EMIOS_2_CH3_H_O
#undef PTF3_LPSPI2_PCS0_I
#undef PTF3_LPSPI2_PCS0_O
#undef PTF3_LPUART6_RX
#undef PTF4_CAN5_TX
#undef PTF4_EIRQ4
#undef PTF4_EMIOS_2_CH4_H_I
#undef PTF4_EMIOS_2_CH4_H_O
#undef PTF4_FXIO_D0_I
#undef PTF4_FXIO_D0_O
#undef PTF5_CAN5_RX
#undef PTF5_EIRQ5
#undef PTF5_EMIOS_2_CH5_H_I
#undef PTF5_EMIOS_2_CH5_H_O
#undef PTF6_EIRQ6
#undef PTF6_EMIOS_2_CH6_H_I
#undef PTF6_EMIOS_2_CH6_H_O
#undef PTF7_EIRQ7
#undef PTF7_EMIOS_2_CH7_H_I
#undef PTF7_EMIOS_2_CH7_H_O
#undef PTF7_FXIO_D1_I
#undef PTF7_FXIO_D1_O
#undef PTF7_LPI2C1_SCL_I
#undef PTF7_LPI2C1_SCL_O
#undef PTF8_EIRQ16
#undef PTF8_EMIOS_2_CH8_X_I
#undef PTF8_EMIOS_2_CH8_X_O
#undef PTF8_FXIO_D2_I
#undef PTF8_FXIO_D2_O
#undef PTF8_LPI2C1_SDA_I
#undef PTF8_LPI2C1_SDA_O
#undef PTF9_ADC0_MA0
#undef PTF9_EIRQ17
#undef PTF9_EMIOS_2_CH9_H_I
#undef PTF9_EMIOS_2_CH9_H_O
#undef PTG0_EIRQ8
#undef PTG0_EMIOS_1_CH16_X_I
#undef PTG0_EMIOS_1_CH16_X_O
#undef PTG0_LPUART13_TX_I
#undef PTG0_LPUART13_TX_O
#undef PTG10_EIRQ26
#undef PTG11_EIRQ27
#undef PTG12_EIRQ28
#undef PTG12_LPSPI4_PCS3_I
#undef PTG12_LPSPI4_PCS3_O
#undef PTG13_CAN5_TX
#undef PTG13_EIRQ29
#undef PTG13_FXIO_D13_I
#undef PTG13_FXIO_D13_O
#undef PTG14_CAN5_RX
#undef PTG14_EIRQ30
#undef PTG15_EIRQ31
#undef PTG15_EMIOS_2_CH15_H_I
#undef PTG15_EMIOS_2_CH15_H_O
#undef PTG15_FXIO_D14_I
#undef PTG15_FXIO_D14_O
#undef PTG15_TRACE_ETM_D1
#undef PTG16_EMIOS_2_CH16_X_I
#undef PTG16_EMIOS_2_CH16_X_O
#undef PTG16_FXIO_D15_I
#undef PTG16_FXIO_D15_O
#undef PTG16_TRACE_ETM_D2
#undef PTG17_EMIOS_2_CH17_Y_I
#undef PTG17_EMIOS_2_CH17_Y_O
#undef PTG17_FXIO_D16_I
#undef PTG17_FXIO_D16_O
#undef PTG17_TRACE_ETM_D4
#undef PTG18_EMIOS_2_CH18_Y_I
#undef PTG18_EMIOS_2_CH18_Y_O
#undef PTG18_FXIO_D17_I
#undef PTG18_FXIO_D17_O
#undef PTG18_TRACE_ETM_D6
#undef PTG19_EMIOS_2_CH19_Y_I
#undef PTG19_EMIOS_2_CH19_Y_O
#undef PTG19_FXIO_D18_I
#undef PTG19_FXIO_D18_O
#undef PTG19_TRACE_ETM_D7
#undef PTG1_EIRQ9
#undef PTG1_EMIOS_1_CH17_Y_I
#undef PTG1_EMIOS_1_CH17_Y_O
#undef PTG1_LPUART13_RX
#undef PTG20_EMIOS_2_CH20_Y_I
#undef PTG20_EMIOS_2_CH20_Y_O
#undef PTG20_FXIO_D19_I
#undef PTG20_FXIO_D19_O
#undef PTG20_TRACE_ETM_D8
#undef PTG21_EMIOS_2_CH21_Y_I
#undef PTG21_EMIOS_2_CH21_Y_O
#undef PTG21_FXIO_D20_I
#undef PTG21_FXIO_D20_O
#undef PTG21_TRACE_ETM_D9
#undef PTG22_EMIOS_2_CH22_X_I
#undef PTG22_EMIOS_2_CH22_X_O
#undef PTG22_FXIO_D21_I
#undef PTG22_FXIO_D21_O
#undef PTG22_TRACE_ETM_D10
#undef PTG23_EMIOS_2_CH23_X_I
#undef PTG23_EMIOS_2_CH23_X_O
#undef PTG23_FXIO_D22_I
#undef PTG23_FXIO_D22_O
#undef PTG23_TRACE_ETM_D11
#undef PTG24_FXIO_D23_I
#undef PTG24_FXIO_D23_O
#undef PTG24_TRACE_ETM_D12
#undef PTG25_FXIO_D24_I
#undef PTG25_FXIO_D24_O
#undef PTG25_TRACE_ETM_D13
#undef PTG26_FXIO_D25_I
#undef PTG26_FXIO_D25_O
#undef PTG26_TRACE_ETM_D14
#undef PTG27_FXIO_D26_I
#undef PTG27_FXIO_D26_O
#undef PTG27_TRACE_ETM_D15
#undef PTG2_EIRQ10
#undef PTG2_EMIOS_1_CH18_Y_I
#undef PTG2_EMIOS_1_CH18_Y_O
#undef PTG2_LPUART14_TX_I
#undef PTG2_LPUART14_TX_O
#undef PTG3_EIRQ11
#undef PTG3_EMIOS_1_CH19_Y_I
#undef PTG3_EMIOS_1_CH19_Y_O
#undef PTG3_LPUART14_RX
#undef PTG4_CMP2_OUT
#undef PTG4_EIRQ12
#undef PTG4_EMIOS_1_CH20_Y_I
#undef PTG4_EMIOS_1_CH20_Y_O
#undef PTG4_LPUART15_TX_I
#undef PTG4_LPUART15_TX_O
#undef PTG5_CMP2_RR_ACTIVE
#undef PTG5_EIRQ13
#undef PTG5_EMIOS_1_CH21_Y_I
#undef PTG5_EMIOS_1_CH21_Y_O
#undef PTG5_LPUART15_RX
#undef PTG6_EIRQ14
#undef PTG6_EMIOS_1_CH22_X_I
#undef PTG6_EMIOS_1_CH22_X_O
#undef PTG6_FXIO_D10_I
#undef PTG6_FXIO_D10_O
#undef PTG6_TRACE_ETM_CLKOUT
#undef PTG7_EIRQ15
#undef PTG7_EMIOS_1_CH23_X_I
#undef PTG7_EMIOS_1_CH23_X_O
#undef PTG7_FXIO_D11_I
#undef PTG7_FXIO_D11_O
#undef PTG7_TRACE_ETM_D0
#undef PTG8_CAN4_TX
#undef PTG8_EIRQ24
#undef PTG8_FXIO_D12_I
#undef PTG8_FXIO_D12_O
#undef PTG9_CAN4_RX
#undef PTG9_EIRQ25
#undef TRGMUX_INT_OUT37_EMIOS_0_CH6_G
#undef TRGMUX_INT_OUT38_EMIOS_0_CH7_G

/* Signals with different mux data on this part */
#undef PTA24_EMIOS_1_CH7_H
#define PTA24_EMIOS_1_CH7_H             NXP_SIUL2_PINMUX(0, 0, 21, 0, 87, 2)
#undef PTA24_FXIO_D3
#define PTA24_FXIO_D3                   NXP_SIUL2_PINMUX(0, 0, 21, 0, 155, 3)
#undef PTA24_GPI24
#define PTA24_GPI24                     NXP_SIUL2_PINMUX(0, 0, 21, 0, 24, 0)
#undef PTA25_EIRQ5
#define PTA25_EIRQ5                     NXP_SIUL2_PINMUX(0, 0, 21, 0, 21, 2)
#undef PTA25_EMIOS_1_CH8_X
#define PTA25_EMIOS_1_CH8_X             NXP_SIUL2_PINMUX(0, 0, 21, 0, 88, 2)
#undef PTA25_FXIO_D2
#define PTA25_FXIO_D2                   NXP_SIUL2_PINMUX(0, 0, 21, 0, 154, 6)
#undef PTA25_GPI25
#define PTA25_GPI25                     NXP_SIUL2_PINMUX(0, 0, 21, 0, 25, 0)

/* Signals specific to this part */
#define PTA15_LPUART1_DTR_B             NXP_SIUL2_PINMUX(0, 0, 15, 5, 0, 0)
#define PTA16_LPUART1_DSR_B             NXP_SIUL2_PINMUX(0, 0, 16, 0, 378, 1)
#define PTA6_LPUART0_RIN_B              NXP_SIUL2_PINMUX(0, 0, 6, 0, 375, 1)
#define PTA7_LPUART0_DCD_B              NXP_SIUL2_PINMUX(0, 0, 7, 0, 374, 1)
#define PTB10_LPUART0_DTR_B             NXP_SIUL2_PINMUX(0, 0, 42, 3, 0, 0)
#define PTB11_LPUART0_DSR_B             NXP_SIUL2_PINMUX(0, 0, 43, 0, 373, 2)
#define PTB12_LPUART0_DCD_B             NXP_SIUL2_PINMUX(0, 0, 44, 0, 374, 2)
#define PTB13_LPUART0_RIN_B             NXP_SIUL2_PINMUX(0, 0, 45, 0, 375, 2)
#define PTB8_LPUART1_DCD_B              NXP_SIUL2_PINMUX(0, 0, 40, 0, 377, 1)
#define PTB9_LPUART1_RIN_B              NXP_SIUL2_PINMUX(0, 0, 41, 0, 376, 1)
#define PTC10_LPUART0_DSR_B             NXP_SIUL2_PINMUX(0, 0, 74, 0, 373, 1)
#define PTC11_LPUART0_DTR_B             NXP_SIUL2_PINMUX(0, 0, 75, 2, 0, 0)
#define PTC17_FXIO_D2_I                 NXP_SIUL2_PINMUX(0, 0, 81, 0, 154, 10)
#define PTC17_FXIO_D2_O                 NXP_SIUL2_PINMUX(0, 0, 81, 7, 0, 0)
#define PTC28_LPUART1_RIN_B             NXP_SIUL2_PINMUX(0, 0, 92, 0, 376, 2)
#define PTC29_LPUART1_DCD_B             NXP_SIUL2_PINMUX(0, 0, 93, 0, 377, 2)
#define PTC30_LPUART1_DSR_B             NXP_SIUL2_PINMUX(0, 0, 94, 0, 378, 2)
#define PTC31_LPUART1_DTR_B             NXP_SIUL2_PINMUX(0, 0, 95, 6, 0, 0)
#define PTD6_FXIO_D3_I                  NXP_SIUL2_PINMUX(0, 0, 102, 0, 155, 9)
#define PTD6_FXIO_D3_O                  NXP_SIUL2_PINMUX(0, 0, 102, 2, 0, 0)
#define PTE12_CMP0_RR_ACTIVE            NXP_SIUL2_PINMUX(0, 0, 140, 1, 0, 0)
#define PTE12_FXIO_D7_I                 NXP_SIUL2_PINMUX(0, 0, 140, 0, 159, 9)
#define PTE12_FXIO_D7_O                 NXP_SIUL2_PINMUX(0, 0, 140, 7, 0, 0)
#define PTE12_SAI1_MCLK                 NXP_SIUL2_PINMUX(0, 0, 140, 0, 324, 2)
#define PTE3_SAI1_D0_I                  NXP_SIUL2_PINMUX(0, 0, 131, 0, 323, 2)
#define PTE3_SAI1_D0_O                  NXP_SIUL2_PINMUX(0, 0, 131, 2, 0, 0)

#endif /* _ZEPHYR_DTS_BINDING_S32K342_K341_K322_172HDQFP_WRAPPER_ */
